[
    {
        "owner_name": "Charlie Z.",
        "business_name": "Core Progression Denver 2",
        "business_address": "3330 Larimer St Ste 1A Denver, CO 80205",
        "business_website": "coreprogression.com/downtown-d…",
        "services_offered": [],
        "amenities": [
            "Wheelchair accessible",
            "Accepts Credit Cards",
            "Bike Parking"
        ],
        "yelp_website": "https://www.yelp.com/biz/core-progression-denver-2?osq=fitness",
        "phone_number": "(720) 792-8968",
        "review_rating": 3.9,
        "number_of_reviews": 10,
        "reviews": [
            {
                "user_name": "Hanna M.",
                "user_location": "Miami Beach, FL",
                "review_date": "Jul 3, 2024",
                "rating": 5,
                "review_text": "I came to Core Progression looking for a comprehensive approach to fitness and nutrition. Jake was fantastic during the consultation, listening to my needs and setting me up with Mike. Mike's nutritional advice, combined with his effective workout plans, has completely transformed my lifestyle. I've seen improvements in my energy levels and overall health, and I couldn't be happier.",
                "reactions": {
                    "Helpful": 0,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Christopher H.",
                "user_location": "Denver, CO",
                "review_date": "Jul 5, 2023",
                "rating": 2,
                "review_text": "I wish I could write a positive review here. I did on Google originally, but I had to update after such disaster experiences. The trainer turnover here is high and it creates to much inconsistency in routines. I'd recommend you hire a direct trainer and cut the gym owner business model out. I thought  it was a good idea but many of the trainers here are underpaid and they leave, which left me in limbo. Twice my trainer left and I had to reach out to ask for a new trainer. I had to, instead of being assigned one.  All of them have talked openly about the low wages. It was kind of disappointing to hear as a client. I felt bad for them regarding their pay but even worse when one told me they were 1099 employees. Just wow.",
                "reactions": {
                    "Helpful": 0,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Ian O.",
                "user_location": "Denver, CO",
                "review_date": "Jul 27, 2023",
                "rating": 1,
                "review_text": "Assuming they pay attention to these, Core will counter this review and reiterate contract, contract, contract. When I signed up initially, it was for twice a week. Started with one trainer who quit, then another who had to leave for personal reasons/but also mentioned being treated poorly with their situation while on leave - similar take from the first trainer who reported being treated poorly. Was then given another trainer who was on her way out the door. Then given another trainer who had Saturday availability only. Not a convenient time for me.",
                "reactions": {
                    "Helpful": 2,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Kat M.",
                "user_location": "Boulder, CO",
                "review_date": "Dec 11, 2023",
                "rating": 1,
                "review_text": "Core Progression Boulder They tried to charge my credit card when I haven't attended there in a year and a half. I am still disputing the charge!!",
                "reactions": {
                    "Helpful": 0,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Martha P.",
                "user_location": "Springfield, IL",
                "review_date": "Jun 21, 2021",
                "rating": 5,
                "review_text": "I found Core Progression Training through a quick Google search. I had just touched down in Denver and felt compelled to reach out based on the reviews that I saw. Sean McCormick called me just a few days later and our first conversation felt like talking to a friend about how I had barely worked out in 30 days since my move. A day after that, I walked into the training gym, completed a sample training session with him, and signed up for a full package. I've been training with Core Progression for 6+ months and I've never looked or felt better. ",
                "reactions": {
                    "Helpful": 1,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Daylon B.",
                "user_location": "Tempe, AZ",
                "review_date": "Apr 22, 2021",
                "rating": 5,
                "review_text": "I recently signed up at Core Progression (one month in). I'm not much of a personal training guy but after my covid 20 (think freshman 15) I decided to make a change and see if I could drop this extra weight. ",
                "reactions": {
                    "Helpful": 1,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Victor R.",
                "user_location": "Denver, CO",
                "review_date": "Sep 18, 2020",
                "rating": 5,
                "review_text": "I started going to Core Progression on their Northglenn location back in 2018 and I transferred my membership to the Rino location last June. ",
                "reactions": {
                    "Helpful": 2,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Jason Y.",
                "user_location": "Golden, CO",
                "review_date": "Sep 9, 2020",
                "rating": 5,
                "review_text": "Great personal gym that is uniquely designed to help people get in the best shape to support their hobbies. Also, ironically, it's probably the best gym situation for covid. Private work with a trainer and limited access make sure everything is clean and you can workout safely. Great location, great trainers and great support. The staff is rock solid and has years of experience to get you where you want to be!",
                "reactions": {
                    "Helpful": 1,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Sadah F.",
                "user_location": "Madison, WI",
                "review_date": "Oct 25, 2019",
                "rating": 5,
                "review_text": "I couldn't have asked for better help! Highly personalized and very thoughtful consultation with achievable goals! Charlie was super helpful and knowledgeable with helping me define my needs and reach my goals. Everyone's setup is highly personalized to their own goals and I recommend booking a consultation!!",
                "reactions": {
                    "Helpful": 1,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Corrine L.",
                "user_location": "Salida, CO",
                "review_date": "Mar 21, 2020",
                "rating": 5,
                "review_text": "Fantastic motivating trainers, the online classes they're doing during the coronavirus shutdown are great!",
                "reactions": {
                    "Helpful": 1,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 0
                }
            }
        ],
        "review_highlights": [
            "“I'm not much of a personal training guy but after my covid 20 (think freshman 15) I decided to make a change and see if I could drop this extra weight.” in 2 reviews",
            "“Monica, Charlie, and Andrea have always been inclusive, helpful, and (most importantly) patient.” in 3 reviews",
            "“I usually go to the small group training classes and both of the coaches, Chantel and Monica, are excellent.” in 2 reviews"
        ],
        "business_categories": [],
        "address": "3330 Larimer St Ste 1A Denver, CO 80205",
        "work_hours": [
            "Mon: 5:00 AM - 9:00 PM",
            "Tue: 5:00 AM - 9:00 PM",
            "Wed: 5:00 AM - 9:00 PM",
            "Thu: 5:00 AM - 9:00 PM",
            "Fri: 5:00 AM - 9:00 PM",
            "Sat: 5:00 AM - 9:00 PM",
            "Sun: 5:00 AM - 9:00 PM"
        ]
    },
    {
        "owner_name": null,
        "business_name": "Movement Rino Denver",
        "business_address": "3201 Walnut St Denver, CO 80205",
        "business_website": "movementgyms.com/rino",
        "services_offered": [],
        "amenities": [
            "Wheelchair accessible",
            "Accepts Credit Cards",
            "Street Parking",
            "Bike Parking"
        ],
        "yelp_website": "https://www.yelp.com/biz/movement-rino-denver?osq=fitness",
        "phone_number": "(720) 667-3059",
        "review_rating": 4.6,
        "number_of_reviews": 10,
        "reviews": [
            {
                "user_name": "Tim B.",
                "user_location": "RIVERDALE, MD",
                "review_date": "Jan 28, 2024",
                "rating": 5,
                "review_text": "Obviously bouldering is dumb and we would all rather be several pitches up a gnarly route. But, this is probably the best bouldering gym I've seen in my life. ",
                "reactions": {
                    "Helpful": 1,
                    "Thanks": 1,
                    "Love this": 1,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Aundya A.",
                "user_location": "Denver, CO",
                "review_date": "Aug 18, 2023",
                "rating": 5,
                "review_text": "Great gym location! The staff members are very friendly, and I enjoy climbing here during the week. Parking can be hit or miss with street parking, but otherwise the gym is a great place to climb and meet other climbers in the area.",
                "reactions": {
                    "Helpful": 0,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Stefanie C.",
                "user_location": "Denver, CO",
                "review_date": "May 28, 2022",
                "rating": 5,
                "review_text": "First bouldering gym in Denver, and first time climbing in four years! Felt so good to be back, and the wonderful staff made it even better. The Movement website makes it super easy to fill out waivers and buy passes so no time is wasted upon arrival. Street parking can be a challenge, but at worse you'll have to walk a block or two.",
                "reactions": {
                    "Helpful": 3,
                    "Thanks": 0,
                    "Love this": 4,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Eva E.",
                "user_location": "Downtown Flushing, Queens, NY",
                "review_date": "Jul 7, 2022",
                "rating": 5,
                "review_text": "Brought my son to Movement RiNo while vacationing in Denver and I'm so glad I did. He had so much fun bouldering here. Filling out the waiver and checking in with Joe was a breeze.  A day pass and shoe rental was $26. I promise you that you won't be disappointed ...",
                "reactions": {
                    "Helpful": 0,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Roger P.",
                "user_location": "San Diego, CA",
                "review_date": "Apr 12, 2022",
                "rating": 5,
                "review_text": "We came on a recommendation from bouldering friends to kill some time and work up an appetite for brunch. Movement RiNo offers some easy beginner paths and challenges the more experienced climbers. ",
                "reactions": {
                    "Helpful": 1,
                    "Thanks": 0,
                    "Love this": 1,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Chris G.",
                "user_location": "CO, CO",
                "review_date": "Jan 25, 2023",
                "rating": 5,
                "review_text": "Great staff, fun and challenging routes, good workout equipment. Just bought a membership after 4 years away from climbing, post-injury.",
                "reactions": {
                    "Helpful": 0,
                    "Thanks": 0,
                    "Love this": 1,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Jim Z.",
                "user_location": "NV, NV",
                "review_date": "Feb 1, 2024",
                "rating": 1,
                "review_text": "hey Movement, you increased my rates 4 times in less than 2 years, yet equipment not fixed, signs on several pieces for 3 weeks to months...dust behind treadmills been there for the 2 yrs i joined also, yet rates keep going up",
                "reactions": {
                    "Helpful": 1,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Alan N.",
                "user_location": "Colorado Springs, CO",
                "review_date": "Apr 2, 2022",
                "rating": 5,
                "review_text": "Wow what a huge Bouldering gym. This place is crazy hooked up, two workout areas, plenty of different style routes, campus boards, moon boards, spray wall, you name it. ",
                "reactions": {
                    "Helpful": 0,
                    "Thanks": 0,
                    "Love this": 1,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Sylvana P.",
                "user_location": "Edgewater, Miami, FL",
                "review_date": "Jan 7, 2023",
                "rating": 5,
                "review_text": "Amazing bouldering gym in Denver! Came while I was on vacation and was super impressed with the climbs, variety to choose from, and the pure size of this place. It's huge! From being able to top off, horizontal routes, and the light up wall, the routes challenge you as a climber to use different techniques and improve on your skills. Great for beginners and experienced climbers! Wish this place was in my hometown, we have nothing like it!!",
                "reactions": {
                    "Helpful": 0,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Crystal K.",
                "user_location": "Denver, CO",
                "review_date": "Aug 2, 2021",
                "rating": 5,
                "review_text": "I attended Movement twice with friends who have memberships, recognizing that my bouldering skills are next to nil. I have really enjoyed the experience with my skilled friends, who are willing to reach me about runs, holds and footing. Movement's staff are always friendly, helpful, and instructional. I listened to one of the staff members assist a new member and they spent about 20 minutes together at a run talking through it with the instructor showing holds and footing. The runs are changed pretty regularly, so you'll never be bored. I've found the people who go to be really friendly and they'll give you tips, too, if you're open to it. I like the community vibe and the membership gives you access to multiple climbing gyms (in Denver and a few other locations).",
                "reactions": {
                    "Helpful": 1,
                    "Thanks": 0,
                    "Love this": 1,
                    "Oh no": 0
                }
            }
        ],
        "review_highlights": [
            "“I attended Movement twice with friends who have memberships, recognizing that my bouldering skills are next to nil.” in 5 reviews",
            "“And there is a good variety of styles -- traditional boulder problems, top-outs, tricky slab, new comp/skate-style, overhang, a cave, and a traverse wall (5.” in 2 reviews",
            "“They have different styles of problems like some with overhang, some with lot of volumes, ect.” in 3 reviews"
        ],
        "business_categories": [],
        "address": "3201 Walnut St Denver, CO 80205",
        "work_hours": [
            "Mon: 6:00 AM - 11:00 PM",
            "Tue: 6:00 AM - 11:00 PM",
            "Wed: 6:00 AM - 11:00 PM",
            "Thu: 6:00 AM - 11:00 PM",
            "Fri: 6:00 AM - 11:00 PM",
            "Sat: 8:00 AM - 8:00 PM",
            "Sun: 8:00 AM - 6:00 PM"
        ]
    },
    {
        "owner_name": null,
        "business_name": "Viv Cycle Denver 2",
        "business_address": "3611 Walnut St Denver, CO 80205",
        "business_website": "vivcycle.com",
        "services_offered": [],
        "amenities": [
            "Accepts Credit Cards",
            "Garage Parking, Street Parking, Validated Parking",
            "Women-owned",
            "Gender-neutral restrooms"
        ],
        "yelp_website": "https://www.yelp.com/biz/viv-cycle-denver-2?osq=fitness",
        "phone_number": "(720) 676-7730",
        "review_rating": 4.4,
        "number_of_reviews": 10,
        "reviews": [
            {
                "user_name": "Diana Z.",
                "user_location": "San Francisco, CA",
                "review_date": "Jun 2, 2024",
                "rating": 5,
                "review_text": "Easily a 5 star rating. I popped in for a community ride with Paige on a Saturday morning and the energy was everything! Paige was amazing, gave amazing encouragement, and really drove the class energy by engaging with the class. As an experienced rider, choreo was approachable, yet still challenging. I could tell everyone was excited to be there too because the class energy was on fire. ",
                "reactions": {
                    "Helpful": 1,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Paula K.",
                "user_location": "Denver, CO",
                "review_date": "Feb 10, 2024",
                "rating": 3,
                "review_text": "I wasn't a fan. I'm a punctual person, yet my first paid class, despite arriving 10 minutes early I was 4 minutes late. There was a ton of construction and no on-street parking despite circling multiple times. Because of the construction I could not figure out how to get into the garage.  I was really looking forward to a workout and did everything right. Yeah. But by the time I got into the garage and literally ran to the door I was  one minute late. They have a 3 minute policy and do not budge. I was greeted at the door by them cracking the door (Three of them standing at the door) to tell me sorry I was late and I couldn't come in and then shutting the door on me. I left my water bottle during my first trial class and didn't even have a chance to ask them if I could retrieve it. So I had no work out, I lost all of the money that I spent on the class and an additional $20 for no show. Classy. ",
                "reactions": {
                    "Helpful": 0,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Joanie W.",
                "user_location": "Denver, CO",
                "review_date": "Jan 7, 2023",
                "rating": 5,
                "review_text": "Such an excellent spin studio! ",
                "reactions": {
                    "Helpful": 0,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Lindsey D.",
                "user_location": "Denver, CO",
                "review_date": "Nov 8, 2023",
                "rating": 5,
                "review_text": "I've been taking indoor cycling classes at Viv for about 2 months now. They have been on my radar, but I was intimidated to try out a class after not taking a live, in-person cycling class for several years. I jumped at the opportunity to take a free class for new riders and am so glad I did. The coaches, staff, and fellow riders are all extremely friendly and helpful. While every cycling studio I've been to says you can take the class at your own pace, I love that the coaches actively encourage this during the ride as it makes me feel more comfortable/confident when I opt to take a fast song in the saddle. The energy is fantastic and I always leave feeling better than I did when I walked in. They also validate for parking in the Hub's garage, which is amazing since street parking can be tough when RiNo is busy in the evenings. If you've been thinking about trying Viv Cycle, I highly recommend you take the leap!",
                "reactions": {
                    "Helpful": 0,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Kaitlyn S.",
                "user_location": "Cincinnati, OH",
                "review_date": "Jul 16, 2022",
                "rating": 5,
                "review_text": "This has to be the best fitness studio in Denver! Viv Cycle is located right in the heart of RiNo. This place is known for their cycle classes but they also offer yoga and strength classes. The vibe right when you walk into their doors is absolutely electric. The instructors and front desk workers are so inviting and welcoming. The cycle classes are extremely upbeat and the music is great. This studio is 100% woman owned and a local business to Denver. I can't wait to come back and continue supporting this little (but mighty) business! ",
                "reactions": {
                    "Helpful": 2,
                    "Thanks": 0,
                    "Love this": 1,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Hailey G.",
                "user_location": "Denver, CO",
                "review_date": "Feb 4, 2023",
                "rating": 5,
                "review_text": "The best fitness studio in Denver, hands down! Everyone is so kind and friendly, which made being a new rider last year so much more welcoming! The instructors are so encouraging and motivating, and not to mention the music is incredible. There's so many things I love about the studio aside from the community, but there's showers (if you have to go to work after a morning class), parking validation, HIIT classes, yoga, Pilates, etc. Truly such a special place!",
                "reactions": {
                    "Helpful": 0,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Tracy C.",
                "user_location": "Northwest, Denver, CO",
                "review_date": "Aug 31, 2022",
                "rating": 1,
                "review_text": "BEWARE!!! SAVE YOUR MONEY THEY HAVE ENOUGH MEMBERS!!",
                "reactions": {
                    "Helpful": 2,
                    "Thanks": 0,
                    "Love this": 2,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Megan F.",
                "user_location": "Denver, CO",
                "review_date": "Oct 5, 2022",
                "rating": 5,
                "review_text": "My favorite spin studio in Denver by far! The staff is very friendly and goes out of their way to learn everyone's name and make them feel welcome. The studio itself is very clean and modern. There are plenty lockers with built in combination locks. The bathroom and shower area is beautiful and stocked with high end products. They have a great spin room with top of the line bikes as well as a stretch room where yoga, strength and Pilates classes are held. The spin classes are so fun with good music and high energy instructors. The class time flys by since it feels like you're at a dance party on a bike. Their unlimited membership has some great partnerships with other gyms so you can switch up your workout routine with Pilates and hiit classes in addition to spin. Highly recommend!",
                "reactions": {
                    "Helpful": 0,
                    "Thanks": 0,
                    "Love this": 1,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Jessica F.",
                "user_location": "Southwest, Denver, CO",
                "review_date": "Aug 22, 2023",
                "rating": 5,
                "review_text": "I absolutely adore this place!! The instructors truly care about their riders and do everything they can to make each class feel exciting and unique. I took a 3 year break and was nervous to come back but I just wish I would have done it sooner. VIV is a gem of a studio and my favorite workout!",
                "reactions": {
                    "Helpful": 0,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Brooke H.",
                "user_location": "Denver, CO",
                "review_date": "Apr 13, 2022",
                "rating": 5,
                "review_text": "Sometimes cycle classes can be a little stuffy and judgmental but Viv is the total opposite. The women that work here are truly so sweet and so encouraging, it's really reflected in the class too - no matter what fitness journey  you are on you can leave the class feeling so accomplished and stronger. Seriously such an amazing place, and just a a bonus it's super cute inside!",
                "reactions": {
                    "Helpful": 0,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 0
                }
            }
        ],
        "review_highlights": [
            "“Viv Cycle is hands-down the greatest fitness studio, not only spin studio, I have been to.” in 4 reviews",
            "“Don't sleep on ViV Cycle if you are in the Denver (Rino) area & take one of their classes, you wont regret it.” in 3 reviews",
            "“Went to a class with Nadine on a Saturday morning.” in 3 reviews"
        ],
        "business_categories": [],
        "address": "3611 Walnut St Denver, CO 80205",
        "work_hours": []
    },
    {
        "owner_name": "Sean G.",
        "business_name": "Club Form Fitness Denver 2",
        "business_address": "1125 17th St Denver, CO 80202",
        "business_website": "clubformdenver.com",
        "services_offered": [],
        "amenities": [
            "Wheelchair accessible",
            "Accepts Credit Cards",
            "Garage Parking, Street Parking, Validated Parking",
            "Open to All"
        ],
        "yelp_website": "https://www.yelp.com/biz/club-form-fitness-denver-2?osq=fitness",
        "phone_number": "(303) 296-2577",
        "review_rating": 4.9,
        "number_of_reviews": 10,
        "reviews": [
            {
                "user_name": "Brian S.",
                "user_location": "Minneapolis, MN",
                "review_date": "Mar 11, 2023",
                "rating": 4,
                "review_text": "I really liked dropping into Club Form during my stay in downtown Denver. It was super easy to get a day pass, and very inexpensive too (although you do need to visit during \"staffed\" hours as a drop-in). Their selection of equipment, while not perfect, was pretty good - they have a few barbells and squat racks, rowers, dumbbells, and a ton of machines. The gym was fairly crowded when I was there, so I did have to share and wait for equipment a few times, keep that in mind if you prefer not to share. There's a small outdoor section if you want to work out outdoors. All in all, a great drop-in option in Downtown Denver!",
                "reactions": {
                    "Helpful": 5,
                    "Thanks": 0,
                    "Love this": 4,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Grace C.",
                "user_location": "Laguna Niguel, CA",
                "review_date": "Nov 12, 2022",
                "rating": 5,
                "review_text": "Great gym with tons of lifting and functional equipment. ",
                "reactions": {
                    "Helpful": 2,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Ricardo A.",
                "user_location": "Silver Spring, MD",
                "review_date": "Feb 12, 2023",
                "rating": 5,
                "review_text": "I was only in town for a night and was in need of a 24 hour gym to get a workout in. Not only was Kate helpful with information but she also went above and beyond to make sure I was able gain access to the gym. My main focus is strength training and this gym had everything I needed. Plenty of squat racks throughout the gym (I chose \"The meat locker\") steel plates, plenty of dumbbells, and if its nice out a great turf area. Would definitely recommend to anyone looking for a home gym, or passing through. Great gym, great customer service. Thanks again Kate!",
                "reactions": {
                    "Helpful": 1,
                    "Thanks": 0,
                    "Love this": 1,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Jeffrey A.",
                "user_location": "Denver, CO",
                "review_date": "Sep 22, 2022",
                "rating": 5,
                "review_text": "An amazing price point for what you receive! Best option in Denver. However, massive impact to my clothing budget... Due to the reduction in my overall mass by participating in this gym, along with my trainer (Scout, you rock) I've had an unexpected re-investment into my clothing inventory... Thanks Club Form! And Jess, you're pretty cool too..",
                "reactions": {
                    "Helpful": 0,
                    "Thanks": 1,
                    "Love this": 0,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Ryan N.",
                "user_location": "Lakewood, CO",
                "review_date": "Jun 22, 2017",
                "rating": 5,
                "review_text": "This review is long overdue, but its time to set my selfishness aside and share this secret with the people.  I don't know where to begin or even end with this review, as I am so grateful for Club Form, as it has changed my life physically and mentally.  ",
                "reactions": {
                    "Helpful": 1,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Daniel H.",
                "user_location": "Manhattan, New York, NY",
                "review_date": "Sep 10, 2020",
                "rating": 5,
                "review_text": "Update: Wrote a mean review and I regret it. The owner of this gym is an all-around good guy and I do really like his club. It is the best bang for your buck and the best hours you will find around downtown Denver.",
                "reactions": {
                    "Helpful": 0,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Travis B.",
                "user_location": "Houston, TX",
                "review_date": "May 3, 2017",
                "rating": 5,
                "review_text": "Awesome gym, with a convenient location downtown, including 3h of validated parking.",
                "reactions": {
                    "Helpful": 0,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Sean O.",
                "user_location": "Denver, CO",
                "review_date": "Nov 17, 2011",
                "rating": 5,
                "review_text": "This is a great gym! They have made some really great improvements and additions. The gym and locker rooms are always clean, the staff is always friendly and the the Gauntlet classes are amazing! Oh, and its open 24 hours! I love it here!",
                "reactions": {
                    "Helpful": 0,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Ari G.",
                "user_location": "Denver, CO",
                "review_date": "Nov 19, 2011",
                "rating": 5,
                "review_text": "This place is great, as the other reviewers have concurred.  I have been a member of this club for a number of years.  New owners came in recently, and have done a great job of making the place what it was meant to be:  a bare-bones, unpretentious health club, with excellent equipment, very friendly staff, and awesome classes.   I agree that the Gauntlet class is an excellent all-around workout.  It will leave you spent, which is the idea!   One recommendation:  add another Gauntlet class on Tuesdays, so we can get that workout 2 x per week.   ",
                "reactions": {
                    "Helpful": 0,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Jim J.",
                "user_location": "Los Angeles, CA",
                "review_date": "Jun 10, 2016",
                "rating": 5,
                "review_text": "Best gym i've ever been to. Has EVERYTHING you need, is relatively clean, open 24 hours a day, located in  great spot, and is relatively cheap. Offers two hour parking as well. Highly recommend.",
                "reactions": {
                    "Helpful": 0,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 0
                }
            }
        ],
        "review_highlights": [
            "“This is one of the greatest features that make Club Form stand out from the other gyms around downtown Denver.” in 3 reviews",
            "“It's actually amazing that they've managed to fit somewhere around 6 to 8 squat racks in this space.” in 3 reviews",
            "“This review is long overdue, but its time to set my selfishness aside and share this secret with the people.” in 2 reviews"
        ],
        "business_categories": [],
        "address": "1125 17th St Denver, CO 80202",
        "work_hours": [
            "Mon: 3:00 AM - 1:00 AM (Next day)",
            "Tue: 3:00 AM - 1:00 AM (Next day)",
            "Wed: 3:00 AM - 1:00 AM (Next day)",
            "Thu: 3:00 AM - 1:00 AM (Next day)",
            "Fri: 3:00 AM - 1:00 AM (Next day)",
            "Sat: 3:00 AM - 1:00 AM (Next day)",
            "Sun: 3:00 AM - 1:00 AM (Next day)"
        ]
    },
    {
        "owner_name": null,
        "business_name": "Genfit Denver 3",
        "business_address": "3660 Downing St Unit C Denver, CO 80205",
        "business_website": "getgenfit.com",
        "services_offered": [],
        "amenities": [
            "Accepts Credit Cards",
            "Bike Parking"
        ],
        "yelp_website": "https://www.yelp.com/biz/genfit-denver-3?osq=fitness",
        "phone_number": "(505) 436-3481",
        "review_rating": 5.0,
        "number_of_reviews": 5,
        "reviews": [
            {
                "user_name": "Janelle H.",
                "user_location": "Lancaster, PA",
                "review_date": "Jan 20, 2017",
                "rating": 5,
                "review_text": "Never a dull moment at GenFit. Always a great workout mixing cardio and weights. Amazing instructors who are genuinely determined to help you meet your fitness goals and work with you every step of the way. Every workout is different, it always challenges you to the max.",
                "reactions": {
                    "Helpful": 1,
                    "Thanks": 0,
                    "Love this": 1,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Mikaela M.",
                "user_location": "Arvada, CO",
                "review_date": "Jun 1, 2018",
                "rating": 5,
                "review_text": "Love this gym. The community is amazing and so friendly. It's always scary checking out a new studio but this on is definitely one to check out. The coaches are amazing. You never get the same workout and leave every time satisfied you were challenged. I reached a fitness plateau before coming here, but after a few months I noticed a lot of change in my body, energy and strength. Although the classes can have a number of individuals the coaches do a great job making sure everyone has great form. They have a couple different classes and each teacher has their own style. Check them out you won't regret it!",
                "reactions": {
                    "Helpful": 0,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Sarah H.",
                "user_location": "Denver, CO",
                "review_date": "Aug 13, 2017",
                "rating": 5,
                "review_text": "Such a great studio with an awesome community and really creative, butt-kicking boot camp classes. The instructors are incredible and do a great job teaching and watching form to prevent injury. Fun place to work out.",
                "reactions": {
                    "Helpful": 0,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Diane N.",
                "user_location": "Denver, CO",
                "review_date": "Aug 31, 2016",
                "rating": 5,
                "review_text": "Found this gym through class pass and I love it! Boot camp style classes,ex military coaches, reminiscent of Orange Theory where they utilize tread mills and then do some kind of weight combo and back to tread mill.  However, each class I go to is different which is awesome. There are group, partner, individual workouts depending on coach of the day. Great find and I highly recommend. Note : no barbell but still very challenging.",
                "reactions": {
                    "Helpful": 0,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Dan K.",
                "user_location": "Denver, CO",
                "review_date": "Aug 31, 2016",
                "rating": 5,
                "review_text": "GenFit's bread and butter is their bootcamp workout. It's a mix of body and cardio and in my opinion the best whole body workout you can get. They offer other programs like yoga and Level 10 which is a program that will test you physically and mentally. The thing I love about GenFit is that everyone is super-friendly and gets to know each other. The competition is fun and friendly and you will not find any douche-baggery here that you may experience at other gyms. ",
                "reactions": {
                    "Helpful": 0,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 0
                }
            }
        ],
        "review_highlights": [],
        "business_categories": [],
        "address": "3660 Downing St Unit C Denver, CO 80205",
        "work_hours": [
            "Mon: 5:30 AM - 7:30 AM",
            "Tue: 5:30 AM - 7:30 AM",
            "Wed: 5:30 AM - 7:30 AM",
            "Thu: 5:30 AM - 7:30 AM",
            "Fri: 5:30 AM - 7:30 AM",
            "Sat: 8:30 AM - 11:00 AM",
            "Sun: Closed"
        ]
    },
    {
        "owner_name": "Ali D.",
        "business_name": "Urban Sanctuary Denver",
        "business_address": "2745 Welton St Denver, CO 80205",
        "business_website": "usdenver.com",
        "services_offered": [
            "Virtual Classes"
        ],
        "amenities": [
            "Wheelchair accessible",
            "Accepts Credit Cards",
            "Bike Parking"
        ],
        "yelp_website": "https://www.yelp.com/biz/urban-sanctuary-denver?osq=fitness",
        "phone_number": "(970) 217-1587",
        "review_rating": 4.6,
        "number_of_reviews": 10,
        "reviews": [
            {
                "user_name": "Jamie M.",
                "user_location": "Henderson, NV",
                "review_date": "Jun 9, 2024",
                "rating": 5,
                "review_text": "We stumbled across this amazing studio that was just steps away from our airbnb in River North. We took three classes in two days. Each class was heart opening, and just what was needed in the moment. The teachers are phenomenal. The studio caters to all levels and body types. The props are amazing and I walked away from each class feeling lighter and more at ease. I highly recommend. As a teacher myself, I like the spiritual vibe offered. The style aligned and I felt right at home. And so it is.",
                "reactions": {
                    "Helpful": 0,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Paola U.",
                "user_location": "Denver, CO",
                "review_date": "Mar 14, 2024",
                "rating": 5,
                "review_text": "Beautiful space to practice yoga. ",
                "reactions": {
                    "Helpful": 0,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Dara L.",
                "user_location": "Phoenix, AZ",
                "review_date": "Jun 9, 2024",
                "rating": 5,
                "review_text": "Inclusive and warm, this studio welcomes you with open arms.  The classes will open your heart and kiss your soul. Truly a magical place for anyone to heal within their practice. Highly recommend!",
                "reactions": {
                    "Helpful": 1,
                    "Thanks": 0,
                    "Love this": 1,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Megan B.",
                "user_location": "Denver, CO",
                "review_date": "Jun 2, 2023",
                "rating": 5,
                "review_text": "No name has ever been more fitting of a space than Urban Sanctuary. The space is so warm with wooden floors, exposed bricks, foliage, a little bit of sun and incense burning. I found the studio through Class Pass and have loved coming back. ",
                "reactions": {
                    "Helpful": 1,
                    "Thanks": 0,
                    "Love this": 1,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Kenzie L.",
                "user_location": "CO, CO",
                "review_date": "Nov 29, 2023",
                "rating": 1,
                "review_text": "Unfortunately I have a billing issue with them they are now ignoring, so until that changes, my review will remain a 1. I got a gift certificate from a family member because I'm struggling with my cancer recovery and couldn't afford this on my own. I canceled my last class which was scheduled at 7am that day. Their policy is that the class has to canceled within 5 hours or you'll still be charged. I canceled 7 hours in advance. They refunded my gift card balance and then later charged my bank account for the class! I emailed them and even got a text confirming the cancelation and the time that was sent. In the beginning Shante was responding within 15 minutes to my emails. Told me I was charged because of the cancelation. After advising Shante that they were wrong in this, she has since refused to email me back. I have followed up twice over the past few days with no response, of course. ",
                "reactions": {
                    "Helpful": 0,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 1
                }
            },
            {
                "user_name": "Tea J.",
                "user_location": "San Diego, CA",
                "review_date": "Jun 1, 2022",
                "rating": 5,
                "review_text": "Decided to take a class here the morning I was heading back home to San Diego, Ca & my friend was heading back to Houston, TX. We came across this place the day before because we had brunch across the street. It was a great morning trying Wingspan: Slow Flow Aerial yoga for the first time. The instructor was great & I really enjoyed myself . Go check them out ladies & gentlemen if your ever in Denver, Colorado.",
                "reactions": {
                    "Helpful": 3,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 1
                }
            },
            {
                "user_name": "Kyana M.",
                "user_location": "Superior, CO",
                "review_date": "Feb 19, 2022",
                "rating": 5,
                "review_text": "I went to Urban Sanctuary for the first time yesterday. The studio is beautiful. ",
                "reactions": {
                    "Helpful": 0,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Anna T.",
                "user_location": "MA, MA",
                "review_date": "Jun 16, 2023",
                "rating": 5,
                "review_text": "I love this studio! The teachers are super friendly. My favorite class has been \"Healing with R&B Vibes\". Steph is amazing! I moved to Denver recently and am so happy I came along to this studio. It's very vibey and the outdoor courtyard is so peaceful :)",
                "reactions": {
                    "Helpful": 0,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Erin Lee M.",
                "user_location": "Denver, CO",
                "review_date": "Jul 25, 2022",
                "rating": 5,
                "review_text": "Best yoga studio EVER!! And I've been to all sorts of unique studios all around the country & world. Urban Sanctuary is really a special lil slice of heaven. The space has been beautifully curated to create a super warm, welcoming vibe-- with tons of plants, meaningful details & a happy embrace of the old building's original character & imperfections. ",
                "reactions": {
                    "Helpful": 1,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 1
                }
            },
            {
                "user_name": "Erica G.",
                "user_location": "Southwest, Denver, CO",
                "review_date": "Oct 28, 2023",
                "rating": 5,
                "review_text": "Best place for healing with community and people of color. It's in a great location in a historic part of town and is HOME!",
                "reactions": {
                    "Helpful": 0,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 0
                }
            }
        ],
        "review_highlights": [
            "“Inclusive and warm, this studio welcomes you with open arms.” in 3 reviews",
            "“All of the teachers are wonderful in their own special ways, and the owner, Ali, is an exceptionally magical human.” in 3 reviews",
            "“The props are amazing and I walked away from each class feeling lighter and more at ease.” in 2 reviews"
        ],
        "business_categories": [],
        "address": "2745 Welton St Denver, CO 80205",
        "work_hours": [
            "Mon: 7:00 AM - 9:00 PM",
            "Tue: 6:00 AM - 9:00 PM",
            "Wed: 7:00 AM - 9:15 PM",
            "Thu: 6:00 AM - 9:00 PM",
            "Fri: 7:00 AM - 7:45 AM",
            "Sat: 9:00 AM - 10:00 PM",
            "Sun: 8:00 AM - 9:00 PM"
        ]
    },
    {
        "owner_name": "Emily S.",
        "business_name": "Platform Strength Denver",
        "business_address": "3198 Blake St Unit 100 Denver, CO 80205",
        "business_website": null,
        "services_offered": [
            "Personal Training",
            "Virtual Classes",
            "Strength Training"
        ],
        "amenities": [],
        "yelp_website": "https://www.yelp.com/biz/platform-strength-denver?osq=fitness",
        "phone_number": "(720) 506-4945",
        "review_rating": 5.0,
        "number_of_reviews": 10,
        "reviews": [
            {
                "user_name": "Alex J.",
                "user_location": "San Francisco, CA",
                "review_date": "Jun 25, 2020",
                "rating": 5,
                "review_text": "Everyone at that works at this gym is amazing- I have had nothing but awesome experiences with Emily, Wade, Gary, and Sav. The others I didn't name are only because I didn't interact with them much.",
                "reactions": {
                    "Helpful": 0,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Jessica W.",
                "user_location": "Broomfield, CO",
                "review_date": "Jul 25, 2019",
                "rating": 5,
                "review_text": "This is the first gym I have gone to consistently in 10 years. All of the trainers are very knowledgeable and are extremely helpful. They are the best trainers I have ever worked with. I walked in having not lifted heavy since highschool and thanks to amazing coaching (call out to coach Sav) I'm finally hitting PRs I never thought I would. ",
                "reactions": {
                    "Helpful": 0,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Paige E.",
                "user_location": "Centennial, CO",
                "review_date": "Jan 21, 2019",
                "rating": 5,
                "review_text": "I've been waiting a long time for a place like this to open! I've never seen a gym that has classes that are super focused on the barbell and heavy lifting (and no, BodyPump classes don't count!). I'm a strong believer in Emily's method and feel that it truly works (I mean, just look at her!). I currently live in the DTC area so I've only gotten to come to a few classes so far but I've loved every single one I've gone to. I always come out with some tips from the trainers, new moves, and feeling like I really pushed myself. I really wish I could come more often. The trainers are incredibly friendly and always ready with some tips to help improve your lifts. I have always weightlifted by myself with no trainer so I'm always happy to get improvement suggestions. This gym also makes barbell lifting feel very accessible to the \"everyday man/woman\". ",
                "reactions": {
                    "Helpful": 1,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Liz E.",
                "user_location": "Louisville, KY",
                "review_date": "Aug 7, 2019",
                "rating": 5,
                "review_text": "tl;dr: BEST GYM EVER!",
                "reactions": {
                    "Helpful": 0,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Morgan T.",
                "user_location": "Denver, CO",
                "review_date": "Dec 7, 2019",
                "rating": 5,
                "review_text": "Do your own thing, do a group thing, do a coached thing...do it all?! You've got options, and if that's overwhelming, they offer a free week for you to figure it out! The peeps who run this place are inviting, patient, funny, and neck-deep in good morals overall. They lift you up at your worst, celebrate your best, and bring an intimate sense of community to an often intimidating space. The gym itself is a gorgeous design and layout -- complete with a sauna, several Olympic lifting platforms, and even a weather-permitting rooftop for workouts and gatherings alike. Don't know the dog policy other than they're totally welcome inside if they aren't dicks! Grab some supplements, herbal tea bags, electrolytes, or swag on your way out...but y'all come back now.",
                "reactions": {
                    "Helpful": 0,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Nick H.",
                "user_location": "Golden, CO",
                "review_date": "Aug 1, 2019",
                "rating": 5,
                "review_text": "Epic Gym, the coaches are incredible and the community keeps it vibin! Coach Savage is exactly that, a combo of super steez and muscle blended with some enthusiasm. Gary the PowerHouse is a baller who motivates with passion - not to mention the guy can bench 6000#. George brings the THUNDER both in and out of the gym, with a collegiate strength coach history and a historic hair flow all in one. Oh wait- did you want a confidence boost from a genuine hype man who just so happens to crush tri's for a hobby?? Cool, then Wademasta Flex is your man. What a team! Oh, should I mention the owner is a serial entrepreneur/STRONGAF WOMAN/overall mega baller? ",
                "reactions": {
                    "Helpful": 0,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Erin L.",
                "user_location": "Denver, CO",
                "review_date": "Jul 29, 2019",
                "rating": 5,
                "review_text": "This gym is amazing! Wonderful atmosphere, attentive and educated trainers. I have been to many gyms in the Denver area and have never felt so welcomed by staff and members. I've seen results in my strength and endurance in a very short time frame. This is NOT a cross for gym!! I have also appreciated having the workouts posted online, so when traveling I can still follow some of the program! ",
                "reactions": {
                    "Helpful": 0,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Conner M.",
                "user_location": "Austin, TX",
                "review_date": "Nov 19, 2019",
                "rating": 5,
                "review_text": "Great gym. Strong community. Amazing coaches. Platform makes my day better regardless of the workout :)",
                "reactions": {
                    "Helpful": 0,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Karady G.",
                "user_location": "Denver, CO",
                "review_date": "Jul 20, 2019",
                "rating": 5,
                "review_text": "Mike was awesome and so was the facility. Loved that they had 3 different options for a workout.",
                "reactions": {
                    "Helpful": 0,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Ron H.",
                "user_location": "Near North Side, Chicago, IL",
                "review_date": "Jul 25, 2019",
                "rating": 5,
                "review_text": "No matter your fitness goals, Platform Strength has the program, the equipment and most importantly the best staff I have ever worked with.  They ensure your form and technique are executed to minimize injury and maximize fitness.   Plus you have fun in the process. Check it out!!!!Best health and fitness facility in Denver.",
                "reactions": {
                    "Helpful": 0,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 0
                }
            }
        ],
        "review_highlights": [
            "“. I'm addicted to this gym in the best way, and it's because of all the wonderful people and fantastic programming” in 4 reviews",
            "“Everyone at that works at this gym is amazing- I have had nothing but awesome experiences with Emily, Wade, Gary, and Sav.” in 3 reviews",
            "“Gary the PowerHouse is a baller who motivates with passion - not to mention the guy can bench 6000#.” in 3 reviews"
        ],
        "business_categories": [],
        "address": "3198 Blake St Unit 100 Denver, CO 80205",
        "work_hours": [
            "Mon: Open 24 hours",
            "Tue: Open 24 hours",
            "Wed: Open 24 hours",
            "Thu: Open 24 hours",
            "Fri: Open 24 hours",
            "Sat: Open 24 hours",
            "Sun: Open 24 hours"
        ]
    },
    {
        "owner_name": "Teddi B.",
        "business_name": "Hot Mamas Exercise Studio Denver",
        "business_address": "2260 E Colfax Ave Denver, CO 80206",
        "business_website": "hotmamasexercise.com",
        "services_offered": [],
        "amenities": [
            "Accepts Credit Cards",
            "Good For Kids"
        ],
        "yelp_website": "https://www.yelp.com/biz/hot-mamas-exercise-studio-denver?osq=fitness",
        "phone_number": "(303) 284-9150",
        "review_rating": 4.5,
        "number_of_reviews": 10,
        "reviews": [
            {
                "user_name": "Audrey B.",
                "user_location": "Denver, CO",
                "review_date": "Oct 16, 2018",
                "rating": 5,
                "review_text": "Teddi and her crew changed my life. I found Hot Mamas on ClassPass and after a week of classes, decided to cancel ClassPass and go with an unlimited monthly membership at Hot Mamas -- best decision. ",
                "reactions": {
                    "Helpful": 2,
                    "Thanks": 0,
                    "Love this": 1,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Megan B.",
                "user_location": "Denver, CO",
                "review_date": "Apr 3, 2018",
                "rating": 4,
                "review_text": "Was pretty nervous about coming here because the website is pretty derogatory. Lots of stuff about men in drag and lots of stereotypes about female fitness. ",
                "reactions": {
                    "Helpful": 1,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Lauren B.",
                "user_location": "Arvada, CO",
                "review_date": "Oct 16, 2018",
                "rating": 5,
                "review_text": "Let me just say I had NO idea how bad ass these ladies were before I attended a class. I signed up for a class knowing only that Hot Mamas opened a new location due to popularity and that they were on class pass but I had no idea the workout would whip me into shape and leave me exhausted but also wanting more. These women are amazing and most of them are moms which makes it just that much better. If you are looking for a tribe, it's here. If you're looking for a work out class that has babysitting, it's here. This is 50 minutes of intense workout that will get your butt into shape quickly all the while understanding that we are all busy! I am so happy I found such a great group to work out with!",
                "reactions": {
                    "Helpful": 0,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Merritt G.",
                "user_location": "Denver, CO",
                "review_date": "May 4, 2020",
                "rating": 5,
                "review_text": "Want to feel empowered and strong? Look no further.  Teddi is motivating, encouraging and wise in all her workouts.  She has purpose behind her programming: results are a given. The studio is hip and clean and there is a strong community that has been built.",
                "reactions": {
                    "Helpful": 0,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Cheryl S.",
                "user_location": "Denver, CO",
                "review_date": "Feb 12, 2017",
                "rating": 5,
                "review_text": "Best studio I've ever been to...here's why- challenging classes, nice variety of workouts, never dull, great music, staff is enthusiastic & personable and every class is unique. I just love the energy here! ",
                "reactions": {
                    "Helpful": 0,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Erica G.",
                "user_location": "Phoenix, AZ",
                "review_date": "Nov 5, 2019",
                "rating": 5,
                "review_text": "The new location is even better and the classes are too! Teddi and all of the instructors deliver such a great workout. Each class I am dripping in sweat and pushing myself further, it's not easy but the best things in life never are! I've noticed that my strength and from in class is improving, not to mention my confidence has gotten a boost. HM is not just for physical strength and a cute booty, but also of mental and emotional. I'm so grateful to have found my way to their new studio a couple of months ago. It's always a bright a shiny part of my day when I get to workout with them. And the community of ladies who workout there are so humble and kind. Love all the in-store pop-ups and events the studio host too! Retail selection is always on point! Thank you Teddi & team for what you bring to class for each of us over and over!",
                "reactions": {
                    "Helpful": 0,
                    "Thanks": 1,
                    "Love this": 0,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Jennifer M.",
                "user_location": "Longmont, CO",
                "review_date": "Sep 13, 2019",
                "rating": 5,
                "review_text": "One of the best workouts I've ever had! Teddi kicked my ass and had me sweating up a storm. It was so fun and the class time flew by! The music and atmosphere is amazing and completely worth the muscle ache later. I can't wait to get back to another class at Hot Mama's!",
                "reactions": {
                    "Helpful": 0,
                    "Thanks": 0,
                    "Love this": 1,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Kayla K.",
                "user_location": "Denver, CO",
                "review_date": "Nov 19, 2016",
                "rating": 5,
                "review_text": "Go here for a killer workout! I have done a lot of different types of workouts in Denver and this studio definitely offers some of the best/most intense. I actually couldn't believe how intense the first class I took ('Sweatin' like a Mutha') was. I also love the \"sexy sweat\" class. They are both very appropriately named as you will certainly be breaking a sweat! I love the music and dancing of the sexy sweat class and am a big fan of any place that make an intense hour of working out seem fun!",
                "reactions": {
                    "Helpful": 0,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Nikki B.",
                "user_location": "Denver, CO",
                "review_date": "Jan 27, 2018",
                "rating": 3,
                "review_text": "Decent classes but the attitude there is just so bad. Unfriendly, very little interaction between anyone and no sense of community or support. The owner seems very full of herself and too cool to give you the time of day. Not what I was hoping for.",
                "reactions": {
                    "Helpful": 0,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Angie R.",
                "user_location": "Denver, CO",
                "review_date": "Jan 18, 2016",
                "rating": 3,
                "review_text": "The workout was intense and that part I loved! But the floor is extremely slippery for the poses the instructor had us doing it was really difficult to keep your footing.",
                "reactions": {
                    "Helpful": 0,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 0
                }
            }
        ],
        "review_highlights": [
            "“Every gym says that right but Teddi really does a great job making a workout for everyone -- All skill levels.” in 11 reviews",
            "“Let me just say I had NO idea how bad ass these ladies were before I attended a class.” in 3 reviews"
        ],
        "business_categories": [],
        "address": "2260 E Colfax Ave Denver, CO 80206",
        "work_hours": [
            "Mon: 6:00 AM - 7:00 PM",
            "Tue: 6:00 AM - 7:00 PM",
            "Wed: 6:00 AM - 7:00 PM",
            "Thu: 6:00 AM - 7:00 PM",
            "Fri: 6:00 AM - 7:00 PM",
            "Sat: 6:00 AM - 5:00 PM",
            "Sun: 6:00 AM - 1:00 PM"
        ]
    },
    {
        "owner_name": "Todd Z.",
        "business_name": "Summit Strong Denver",
        "business_address": "800 Lincoln St Denver, CO 80203",
        "business_website": "summitstrong.com",
        "services_offered": [],
        "amenities": [
            "Wheelchair accessible",
            "Accepts Credit Cards",
            "1:1 sessions available"
        ],
        "yelp_website": "https://www.yelp.com/biz/summit-strong-denver?osq=fitness",
        "phone_number": "(720) 328-3897",
        "review_rating": 4.1,
        "number_of_reviews": 10,
        "reviews": [
            {
                "user_name": "Michael P.",
                "user_location": "Denver, CO",
                "review_date": "Mar 27, 2024",
                "rating": 5,
                "review_text": "Please Read!",
                "reactions": {
                    "Helpful": 0,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Evon R.",
                "user_location": "West, Denver, CO",
                "review_date": "May 28, 2024",
                "rating": 5,
                "review_text": "Great local gym. Super stoked",
                "reactions": {
                    "Helpful": 0,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Arturo P.",
                "user_location": "Denver, CO",
                "review_date": "Dec 20, 2023",
                "rating": 1,
                "review_text": "\"Members don't read their agreements\" - The owner Todd",
                "reactions": {
                    "Helpful": 4,
                    "Thanks": 0,
                    "Love this": 1,
                    "Oh no": 1
                }
            },
            {
                "user_name": "Ernest D.",
                "user_location": "Southwest, Denver, CO",
                "review_date": "Feb 13, 2024",
                "rating": 5,
                "review_text": "This fitness center boasts an excellent arrangement, a welcoming team, an exceptional ambiance, and I would definitely return here without hesitation.",
                "reactions": {
                    "Helpful": 0,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Jared S.",
                "user_location": "Tybee Island, GA",
                "review_date": "Jun 1, 2023",
                "rating": 5,
                "review_text": "I have been active in multiple weightlifting and powerlifting organizations of the years and while travel finding a good gym is always hard. Summit Strong was an awesome facility. It's not the biggest thing in the world, but they use a great layout for their space when I say this gym has everything... This gym has everything from specialty bars and equipment to mobility and rehab equipment. Love that it has a few garage doors that open to the street to give the gym an open air aspect. If you're in the area I would definitely recommend this gym.",
                "reactions": {
                    "Helpful": 0,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Luke K.",
                "user_location": "San Francisco, CA",
                "review_date": "Oct 22, 2023",
                "rating": 4,
                "review_text": "good gym, solid equipment that will help you become a better version of you.",
                "reactions": {
                    "Helpful": 0,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 0
                }
            },
            {
                "user_name": "An O.",
                "user_location": "Manhattan, NY",
                "review_date": "Nov 2, 2023",
                "rating": 5,
                "review_text": "I've been doing 1-1 kickboxing training with Nate Cortez for about a year. Despite his youthful boyish looks he knows what he's doing, he's a great coach who makes every session different, he is calm, patient and a talented trainer.",
                "reactions": {
                    "Helpful": 0,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Jeanette L.",
                "user_location": "Rowland Heights, CA",
                "review_date": "Jul 9, 2022",
                "rating": 5,
                "review_text": "This gym has a great set up, friendly staff, A great  Atmosphere and 10/10 would come here again",
                "reactions": {
                    "Helpful": 0,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Reagan S.",
                "user_location": "Southwest, Denver, CO",
                "review_date": "Apr 26, 2023",
                "rating": 5,
                "review_text": "Amazing gym with equipment you won't see many places. When they open the garage windows it's 10x better",
                "reactions": {
                    "Helpful": 0,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Richard N.",
                "user_location": "Denver, CO",
                "review_date": "Feb 27, 2022",
                "rating": 1,
                "review_text": "Ridiculous. After canceling my membership, this gym has repeatedly charged me despite several in-person attempts and phone calls claiming to have resolved the issue. Arguably, it is the most unprofessional business I've ever dealt with in Denver.",
                "reactions": {
                    "Helpful": 7,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 0
                }
            }
        ],
        "review_highlights": [
            "“I have been able to take my fitness to another level at Vital thanks to a healthy lifestyle, nutrition, and hard work.” in 10 reviews",
            "“They have plenty of \"squat racks\" for lack of a better word for barbell squats, or military presses.” in 4 reviews",
            "“Todd is fantastic about correcting posture and body position, motivating, and keeping you on top of your goals.” in 2 reviews"
        ],
        "business_categories": [],
        "address": "800 Lincoln St Denver, CO 80203",
        "work_hours": [
            "Mon: 5:00 AM - 9:00 PM",
            "Tue: 5:00 AM - 9:00 PM",
            "Wed: 5:00 AM - 9:00 PM",
            "Thu: 5:00 AM - 9:00 PM",
            "Fri: 5:00 AM - 8:00 PM",
            "Sat: 7:00 AM - 6:00 PM",
            "Sun: 10:00 AM - 4:00 PM"
        ]
    },
    {
        "owner_name": "Jason M.",
        "business_name": "Denver Athletic Club Denver",
        "business_address": "1325 Glenarm Pl Denver, CO 80204",
        "business_website": "denverathleticclub.cc",
        "services_offered": [
            "Virtual Classes",
            "Virtual Consultations"
        ],
        "amenities": [
            "Good For Kids",
            "Garage Parking, Street Parking, Private Lot Parking",
            "Bike Parking"
        ],
        "yelp_website": "https://www.yelp.com/biz/denver-athletic-club-denver?osq=fitness",
        "phone_number": "(303) 534-1211",
        "review_rating": 3.7,
        "number_of_reviews": 10,
        "reviews": [
            {
                "user_name": "Joseph A.",
                "user_location": "St. John, IN",
                "review_date": "Feb 26, 2024",
                "rating": 4,
                "review_text": "Great facility. Wonderful amenities. Restaurants were all good to very good and the staff is always professional and courteous.",
                "reactions": {
                    "Helpful": 0,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Drew M.",
                "user_location": "Northwest, Denver, CO",
                "review_date": "Dec 27, 2023",
                "rating": 2,
                "review_text": "Super bummed I drove out of my way to check out the gym just to find out I need to schedule a tour. Was kind of blown off. Was ready and excited to get the new year started with a gym that offers a lot. But I got pretty turned off by location and way I was greeted and shot down.",
                "reactions": {
                    "Helpful": 1,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Carly W.",
                "user_location": "Denver, CO",
                "review_date": "Jun 2, 2018",
                "rating": 4,
                "review_text": "The fiancé and I had the pleasure of attending our friends nuptials at Denver Athletic Club and I must say I was impressed!",
                "reactions": {
                    "Helpful": 30,
                    "Thanks": 0,
                    "Love this": 27,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Vanessa C.",
                "user_location": "Beverly Hills, CA",
                "review_date": "May 28, 2017",
                "rating": 5,
                "review_text": "This place may not be the prettiest place but it's so rich in its history. By the way they are rehabbing it over the summer. ",
                "reactions": {
                    "Helpful": 2,
                    "Thanks": 0,
                    "Love this": 3,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Rumesh V.",
                "user_location": "Washington, DC",
                "review_date": "Jan 26, 2019",
                "rating": 5,
                "review_text": "Wow! This is the best gym I have ever been to. I was a member of lifetime athletics in Maryland and I felt that was the best gym but when I visited DAC I was blown away by their amazing facility. ",
                "reactions": {
                    "Helpful": 4,
                    "Thanks": 0,
                    "Love this": 1,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Marissa R.",
                "user_location": "CO, CO",
                "review_date": "Sep 22, 2022",
                "rating": 1,
                "review_text": "I don't even know where to begin.. but do not work or hold an event at this facility! I had very valuable stuff stolen from a managers office and was told this isn't the first time and they think it's someone who works for them? No action was taken on resolving the matter and management wanted nothing to do with moving forward. It is a complete chaos of a place and I suggest you do not get married there or it will all be thrown together the day of with no leadership.",
                "reactions": {
                    "Helpful": 2,
                    "Thanks": 0,
                    "Love this": 1,
                    "Oh no": 1
                }
            },
            {
                "user_name": "Ray A.",
                "user_location": "Denver, CO",
                "review_date": "Oct 1, 2020",
                "rating": 5,
                "review_text": "The best place to work and workout in Denver. Covers an entire city clock, open 24/7/365, and has everything you can imagine to do activity-wise including a bowling alley. Looking forward to the remodel.",
                "reactions": {
                    "Helpful": 2,
                    "Thanks": 0,
                    "Love this": 0,
                    "Oh no": 1
                }
            },
            {
                "user_name": "Brad O.",
                "user_location": "Denver, CO",
                "review_date": "Nov 11, 2021",
                "rating": 5,
                "review_text": "I see some negative reviews here and honestly I don't know why and feel the negatives don't get it and what they're paying for... they don't understand the bigger picture. From my point of view this is an excellently well ran club. Membership director is approachable and on it, so is guest services as well as membership services. You have access to a brand new gym that is rarely crowded and over 200 reciprocal clubs. It doesn't get the love it deserves. Good people. Good fun, and if you get it, join",
                "reactions": {
                    "Helpful": 1,
                    "Thanks": 0,
                    "Love this": 1,
                    "Oh no": 1
                }
            },
            {
                "user_name": "Victoria M.",
                "user_location": "Denver, CO",
                "review_date": "Jul 29, 2016",
                "rating": 5,
                "review_text": "Joined this Athletic club about a month ago, and I must say it is as good as it gets! ",
                "reactions": {
                    "Helpful": 3,
                    "Thanks": 0,
                    "Love this": 1,
                    "Oh no": 0
                }
            },
            {
                "user_name": "Carey H.",
                "user_location": "Las Vegas, NV",
                "review_date": "Apr 1, 2019",
                "rating": 1,
                "review_text": "Thanks for wasting my day. Traveling to Denver for work. Calmed and asked about a day pass, they said, yes they offer. Walked 20 min here and got turned away at the door. Avoid this place.",
                "reactions": {
                    "Helpful": 6,
                    "Thanks": 0,
                    "Love this": 2,
                    "Oh no": 0
                }
            }
        ],
        "review_highlights": [
            "“Covers an entire city clock, open 24/7/365, and has everything you can imagine to do activity-wise including a bowling alley.” in 6 reviews",
            "“I could go on and on with squash, climbing wall, etc..  I've visited all the gyms in Denver and as far as athletic facilities go, it is head and shoulders above every other gym.” in 2 reviews",
            "“The social networking possibilities are endless and you are getting to spend time with driven, successful professionals, both younger and older, and that seems completely worth the money to me.” in 3 reviews"
        ],
        "business_categories": [],
        "address": "1325 Glenarm Pl Denver, CO 80204",
        "work_hours": [
            "Mon: Open 24 hours",
            "Tue: Open 24 hours",
            "Wed: Open 24 hours",
            "Thu: Open 24 hours",
            "Fri: Open 24 hours",
            "Sat: Open 24 hours",
            "Sun: Open 24 hours"
        ]
    }
]